; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=345, out_folder=./training, instance_id=75, seed=2099, goal_proportion=0.03

(define (problem blocksworld-75)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 - object)
 (:init 
    (arm-empty)
    (clear b67)
    (on b67 b293)
    (on b293 b183)
    (on b183 b121)
    (on b121 b108)
    (on b108 b276)
    (on b276 b194)
    (on b194 b20)
    (on-table b20)
    (clear b192)
    (on b192 b116)
    (on b116 b273)
    (on b273 b113)
    (on b113 b298)
    (on b298 b94)
    (on b94 b249)
    (on-table b249)
    (clear b158)
    (on b158 b274)
    (on b274 b319)
    (on b319 b303)
    (on-table b303)
    (clear b156)
    (on b156 b165)
    (on-table b165)
    (clear b164)
    (on b164 b252)
    (on b252 b128)
    (on b128 b139)
    (on-table b139)
    (clear b185)
    (on b185 b197)
    (on-table b197)
    (clear b148)
    (on b148 b63)
    (on b63 b209)
    (on b209 b29)
    (on b29 b154)
    (on b154 b42)
    (on-table b42)
    (clear b267)
    (on b267 b76)
    (on b76 b204)
    (on b204 b235)
    (on b235 b66)
    (on-table b66)
    (clear b269)
    (on b269 b241)
    (on-table b241)
    (clear b178)
    (on b178 b250)
    (on b250 b8)
    (on b8 b262)
    (on b262 b240)
    (on b240 b193)
    (on b193 b68)
    (on b68 b228)
    (on b228 b3)
    (on b3 b229)
    (on b229 b19)
    (on b19 b213)
    (on b213 b83)
    (on b83 b35)
    (on b35 b280)
    (on b280 b175)
    (on b175 b45)
    (on b45 b43)
    (on b43 b18)
    (on b18 b105)
    (on b105 b134)
    (on b134 b49)
    (on b49 b226)
    (on-table b226)
    (clear b97)
    (on-table b97)
    (clear b201)
    (on-table b201)
    (clear b230)
    (on b230 b232)
    (on b232 b275)
    (on b275 b314)
    (on-table b314)
    (clear b22)
    (on b22 b69)
    (on-table b69)
    (clear b138)
    (on b138 b247)
    (on b247 b6)
    (on-table b6)
    (clear b136)
    (on b136 b255)
    (on b255 b55)
    (on b55 b133)
    (on-table b133)
    (clear b72)
    (on b72 b33)
    (on b33 b118)
    (on b118 b291)
    (on b291 b28)
    (on b28 b217)
    (on-table b217)
    (clear b102)
    (on b102 b168)
    (on b168 b73)
    (on b73 b124)
    (on b124 b11)
    (on b11 b180)
    (on-table b180)
    (clear b223)
    (on b223 b24)
    (on-table b24)
    (clear b131)
    (on b131 b56)
    (on b56 b112)
    (on b112 b1)
    (on b1 b245)
    (on b245 b211)
    (on b211 b236)
    (on b236 b264)
    (on b264 b17)
    (on b17 b336)
    (on b336 b174)
    (on b174 b57)
    (on b57 b290)
    (on b290 b199)
    (on b199 b151)
    (on b151 b258)
    (on b258 b338)
    (on b338 b160)
    (on b160 b89)
    (on b89 b104)
    (on b104 b334)
    (on b334 b110)
    (on b110 b80)
    (on-table b80)
    (clear b16)
    (on b16 b88)
    (on b88 b279)
    (on b279 b340)
    (on b340 b47)
    (on b47 b260)
    (on b260 b231)
    (on b231 b256)
    (on b256 b137)
    (on b137 b286)
    (on-table b286)
    (clear b44)
    (on b44 b39)
    (on b39 b326)
    (on-table b326)
    (clear b257)
    (on-table b257)
    (clear b254)
    (on b254 b234)
    (on-table b234)
    (clear b189)
    (on b189 b54)
    (on b54 b91)
    (on b91 b46)
    (on b46 b253)
    (on-table b253)
    (clear b332)
    (on b332 b75)
    (on b75 b220)
    (on-table b220)
    (clear b294)
    (on b294 b159)
    (on-table b159)
    (clear b246)
    (on b246 b61)
    (on-table b61)
    (clear b263)
    (on-table b263)
    (clear b322)
    (on b322 b122)
    (on b122 b306)
    (on b306 b331)
    (on-table b331)
    (clear b251)
    (on b251 b71)
    (on b71 b186)
    (on-table b186)
    (clear b227)
    (on b227 b114)
    (on b114 b184)
    (on-table b184)
    (clear b282)
    (on-table b282)
    (clear b215)
    (on-table b215)
    (clear b169)
    (on b169 b129)
    (on b129 b296)
    (on b296 b330)
    (on-table b330)
    (clear b106)
    (on b106 b70)
    (on b70 b316)
    (on-table b316)
    (clear b177)
    (on b177 b143)
    (on b143 b191)
    (on b191 b36)
    (on b36 b77)
    (on b77 b74)
    (on-table b74)
    (clear b281)
    (on b281 b37)
    (on-table b37)
    (clear b13)
    (on b13 b335)
    (on b335 b41)
    (on b41 b299)
    (on-table b299)
    (clear b163)
    (on b163 b4)
    (on b4 b155)
    (on b155 b82)
    (on-table b82)
    (clear b196)
    (on b196 b328)
    (on-table b328)
    (clear b125)
    (on b125 b287)
    (on b287 b305)
    (on b305 b86)
    (on b86 b12)
    (on b12 b225)
    (on b225 b210)
    (on-table b210)
    (clear b320)
    (on b320 b312)
    (on-table b312)
    (clear b292)
    (on b292 b119)
    (on b119 b162)
    (on b162 b333)
    (on b333 b238)
    (on-table b238)
    (clear b153)
    (on b153 b344)
    (on-table b344)
    (clear b176)
    (on-table b176)
    (clear b145)
    (on b145 b271)
    (on b271 b297)
    (on b297 b130)
    (on b130 b341)
    (on b341 b25)
    (on b25 b224)
    (on-table b224)
    (clear b30)
    (on b30 b327)
    (on b327 b304)
    (on b304 b132)
    (on b132 b325)
    (on b325 b5)
    (on-table b5)
    (clear b14)
    (on b14 b289)
    (on b289 b313)
    (on-table b313)
    (clear b207)
    (on-table b207)
    (clear b52)
    (on-table b52)
    (clear b318)
    (on b318 b188)
    (on b188 b309)
    (on b309 b268)
    (on b268 b266)
    (on b266 b288)
    (on b288 b308)
    (on b308 b152)
    (on b152 b173)
    (on b173 b9)
    (on b9 b81)
    (on b81 b87)
    (on b87 b244)
    (on b244 b345)
    (on b345 b59)
    (on-table b59)
    (clear b117)
    (on b117 b233)
    (on-table b233)
    (clear b310)
    (on-table b310)
    (clear b307)
    (on b307 b126)
    (on b126 b182)
    (on b182 b278)
    (on b278 b78)
    (on-table b78)
    (clear b315)
    (on b315 b161)
    (on b161 b187)
    (on b187 b343)
    (on b343 b99)
    (on b99 b190)
    (on-table b190)
    (clear b96)
    (on b96 b85)
    (on b85 b149)
    (on b149 b166)
    (on b166 b321)
    (on b321 b285)
    (on b285 b84)
    (on b84 b300)
    (on-table b300)
    (clear b329)
    (on b329 b265)
    (on b265 b93)
    (on b93 b167)
    (on-table b167)
    (clear b283)
    (on-table b283)
    (clear b50)
    (on-table b50)
    (clear b90)
    (on b90 b212)
    (on b212 b140)
    (on b140 b311)
    (on b311 b179)
    (on b179 b32)
    (on b32 b107)
    (on b107 b115)
    (on b115 b26)
    (on-table b26)
    (clear b101)
    (on b101 b200)
    (on b200 b317)
    (on b317 b15)
    (on b15 b195)
    (on b195 b60)
    (on b60 b51)
    (on-table b51)
    (clear b337)
    (on b337 b100)
    (on b100 b53)
    (on b53 b150)
    (on b150 b2)
    (on b2 b339)
    (on-table b339)
    (clear b170)
    (on-table b170)
    (clear b157)
    (on-table b157)
    (clear b172)
    (on b172 b295)
    (on-table b295)
    (clear b65)
    (on b65 b242)
    (on b242 b239)
    (on-table b239)
    (clear b98)
    (on b98 b38)
    (on b38 b261)
    (on b261 b120)
    (on-table b120)
    (clear b109)
    (on b109 b147)
    (on b147 b203)
    (on-table b203)
    (clear b23)
    (on-table b23)
    (clear b135)
    (on b135 b146)
    (on b146 b171)
    (on b171 b218)
    (on b218 b198)
    (on b198 b64)
    (on-table b64)
    (clear b277)
    (on b277 b92)
    (on b92 b40)
    (on b40 b284)
    (on b284 b95)
    (on b95 b58)
    (on b58 b31)
    (on-table b31)
    (clear b237)
    (on-table b237)
    (clear b34)
    (on b34 b123)
    (on b123 b79)
    (on b79 b243)
    (on b243 b202)
    (on-table b202)
    (clear b10)
    (on b10 b301)
    (on b301 b248)
    (on-table b248)
    (clear b221)
    (on b221 b181)
    (on b181 b206)
    (on b206 b48)
    (on-table b48)
    (clear b141)
    (on b141 b259)
    (on b259 b323)
    (on b323 b216)
    (on b216 b324)
    (on b324 b144)
    (on-table b144)
    (clear b272)
    (on-table b272)
    (clear b214)
    (on b214 b21)
    (on b21 b222)
    (on-table b222)
    (clear b342)
    (on b342 b302)
    (on b302 b111)
    (on b111 b270)
    (on b270 b205)
    (on-table b205)
    (clear b127)
    (on b127 b7)
    (on b7 b27)
    (on b27 b62)
    (on b62 b142)
    (on b142 b208)
    (on b208 b103)
    (on b103 b219)
    (on-table b219))
 (:goal  (and 
    (clear b8)
    (on-table b8)
    (clear b6)
    (on-table b6)
    (clear b3)
    (on b3 b5)
    (on b5 b1)
    (on b1 b2)
    (on b2 b4)
    (on b4 b10)
    (on-table b10)
    (clear b9)
    (on b9 b7)
    (on-table b7))))

; plan
1. (unstack b10 b301)
   deleted: (on b10 b301) (clear b10) (arm-empty)
   added: (holding b10) (clear b301)
   goals met: 1 of 14
2. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 2 of 14
3. (unstack b127 b7)
   deleted: (on b127 b7) (clear b127) (arm-empty)
   added: (holding b127) (clear b7)
   goals met: 2 of 14
4. (putdown b127)
   deleted: (holding b127)
   added: (clear b127) (arm-empty) (on-table b127)
   goals met: 2 of 14
5. (unstack b7 b27)
   deleted: (on b7 b27) (clear b7) (arm-empty)
   added: (holding b7) (clear b27)
   goals met: 2 of 14
6. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 3 of 14
7. (unstack b131 b56)
   deleted: (on b131 b56) (clear b131) (arm-empty)
   added: (holding b131) (clear b56)
   goals met: 3 of 14
8. (putdown b131)
   deleted: (holding b131)
   added: (clear b131) (arm-empty) (on-table b131)
   goals met: 3 of 14
9. (unstack b138 b247)
   deleted: (on b138 b247) (clear b138) (arm-empty)
   added: (holding b138) (clear b247)
   goals met: 3 of 14
10. (putdown b138)
   deleted: (holding b138)
   added: (clear b138) (arm-empty) (on-table b138)
   goals met: 3 of 14
11. (unstack b163 b4)
   deleted: (on b163 b4) (clear b163) (arm-empty)
   added: (holding b163) (clear b4)
   goals met: 3 of 14
12. (putdown b163)
   deleted: (holding b163)
   added: (clear b163) (arm-empty) (on-table b163)
   goals met: 3 of 14
13. (unstack b178 b250)
   deleted: (on b178 b250) (clear b178) (arm-empty)
   added: (holding b178) (clear b250)
   goals met: 3 of 14
14. (putdown b178)
   deleted: (holding b178)
   added: (clear b178) (arm-empty) (on-table b178)
   goals met: 3 of 14
15. (unstack b247 b6)
   deleted: (on b247 b6) (clear b247) (arm-empty)
   added: (holding b247) (clear b6)
   goals met: 4 of 14
16. (putdown b247)
   deleted: (holding b247)
   added: (clear b247) (arm-empty) (on-table b247)
   goals met: 4 of 14
17. (unstack b250 b8)
   deleted: (on b250 b8) (clear b250) (arm-empty)
   added: (holding b250) (clear b8)
   goals met: 5 of 14
18. (putdown b250)
   deleted: (holding b250)
   added: (clear b250) (arm-empty) (on-table b250)
   goals met: 5 of 14
19. (unstack b8 b262)
   deleted: (on b8 b262) (clear b8) (arm-empty)
   added: (holding b8) (clear b262)
   goals met: 4 of 14
20. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 6 of 14
21. (unstack b262 b240)
   deleted: (on b262 b240) (clear b262) (arm-empty)
   added: (holding b262) (clear b240)
   goals met: 6 of 14
22. (putdown b262)
   deleted: (holding b262)
   added: (clear b262) (arm-empty) (on-table b262)
   goals met: 6 of 14
23. (unstack b240 b193)
   deleted: (on b240 b193) (clear b240) (arm-empty)
   added: (holding b240) (clear b193)
   goals met: 6 of 14
24. (putdown b240)
   deleted: (holding b240)
   added: (clear b240) (arm-empty) (on-table b240)
   goals met: 6 of 14
25. (unstack b193 b68)
   deleted: (on b193 b68) (clear b193) (arm-empty)
   added: (holding b193) (clear b68)
   goals met: 6 of 14
26. (putdown b193)
   deleted: (holding b193)
   added: (clear b193) (arm-empty) (on-table b193)
   goals met: 6 of 14
27. (unstack b30 b327)
   deleted: (on b30 b327) (clear b30) (arm-empty)
   added: (holding b30) (clear b327)
   goals met: 6 of 14
28. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 6 of 14
29. (unstack b318 b188)
   deleted: (on b318 b188) (clear b318) (arm-empty)
   added: (holding b318) (clear b188)
   goals met: 6 of 14
30. (putdown b318)
   deleted: (holding b318)
   added: (clear b318) (arm-empty) (on-table b318)
   goals met: 6 of 14
31. (unstack b188 b309)
   deleted: (on b188 b309) (clear b188) (arm-empty)
   added: (holding b188) (clear b309)
   goals met: 6 of 14
32. (putdown b188)
   deleted: (holding b188)
   added: (clear b188) (arm-empty) (on-table b188)
   goals met: 6 of 14
33. (unstack b309 b268)
   deleted: (on b309 b268) (clear b309) (arm-empty)
   added: (holding b309) (clear b268)
   goals met: 6 of 14
34. (putdown b309)
   deleted: (holding b309)
   added: (clear b309) (arm-empty) (on-table b309)
   goals met: 6 of 14
35. (unstack b268 b266)
   deleted: (on b268 b266) (clear b268) (arm-empty)
   added: (holding b268) (clear b266)
   goals met: 6 of 14
36. (putdown b268)
   deleted: (holding b268)
   added: (clear b268) (arm-empty) (on-table b268)
   goals met: 6 of 14
37. (unstack b266 b288)
   deleted: (on b266 b288) (clear b266) (arm-empty)
   added: (holding b266) (clear b288)
   goals met: 6 of 14
38. (putdown b266)
   deleted: (holding b266)
   added: (clear b266) (arm-empty) (on-table b266)
   goals met: 6 of 14
39. (unstack b288 b308)
   deleted: (on b288 b308) (clear b288) (arm-empty)
   added: (holding b288) (clear b308)
   goals met: 6 of 14
40. (putdown b288)
   deleted: (holding b288)
   added: (clear b288) (arm-empty) (on-table b288)
   goals met: 6 of 14
41. (unstack b308 b152)
   deleted: (on b308 b152) (clear b308) (arm-empty)
   added: (holding b308) (clear b152)
   goals met: 6 of 14
42. (putdown b308)
   deleted: (holding b308)
   added: (clear b308) (arm-empty) (on-table b308)
   goals met: 6 of 14
43. (unstack b152 b173)
   deleted: (on b152 b173) (clear b152) (arm-empty)
   added: (holding b152) (clear b173)
   goals met: 6 of 14
44. (putdown b152)
   deleted: (holding b152)
   added: (clear b152) (arm-empty) (on-table b152)
   goals met: 6 of 14
45. (unstack b173 b9)
   deleted: (on b173 b9) (clear b173) (arm-empty)
   added: (holding b173) (clear b9)
   goals met: 7 of 14
46. (putdown b173)
   deleted: (holding b173)
   added: (clear b173) (arm-empty) (on-table b173)
   goals met: 7 of 14
47. (unstack b327 b304)
   deleted: (on b327 b304) (clear b327) (arm-empty)
   added: (holding b327) (clear b304)
   goals met: 7 of 14
48. (putdown b327)
   deleted: (holding b327)
   added: (clear b327) (arm-empty) (on-table b327)
   goals met: 7 of 14
49. (unstack b304 b132)
   deleted: (on b304 b132) (clear b304) (arm-empty)
   added: (holding b304) (clear b132)
   goals met: 7 of 14
50. (putdown b304)
   deleted: (holding b304)
   added: (clear b304) (arm-empty) (on-table b304)
   goals met: 7 of 14
51. (unstack b132 b325)
   deleted: (on b132 b325) (clear b132) (arm-empty)
   added: (holding b132) (clear b325)
   goals met: 7 of 14
52. (putdown b132)
   deleted: (holding b132)
   added: (clear b132) (arm-empty) (on-table b132)
   goals met: 7 of 14
53. (unstack b325 b5)
   deleted: (on b325 b5) (clear b325) (arm-empty)
   added: (holding b325) (clear b5)
   goals met: 7 of 14
54. (putdown b325)
   deleted: (holding b325)
   added: (clear b325) (arm-empty) (on-table b325)
   goals met: 7 of 14
55. (unstack b337 b100)
   deleted: (on b337 b100) (clear b337) (arm-empty)
   added: (holding b337) (clear b100)
   goals met: 7 of 14
56. (putdown b337)
   deleted: (holding b337)
   added: (clear b337) (arm-empty) (on-table b337)
   goals met: 7 of 14
57. (unstack b100 b53)
   deleted: (on b100 b53) (clear b100) (arm-empty)
   added: (holding b100) (clear b53)
   goals met: 7 of 14
58. (putdown b100)
   deleted: (holding b100)
   added: (clear b100) (arm-empty) (on-table b100)
   goals met: 7 of 14
59. (unstack b53 b150)
   deleted: (on b53 b150) (clear b53) (arm-empty)
   added: (holding b53) (clear b150)
   goals met: 7 of 14
60. (putdown b53)
   deleted: (holding b53)
   added: (clear b53) (arm-empty) (on-table b53)
   goals met: 7 of 14
61. (unstack b150 b2)
   deleted: (on b150 b2) (clear b150) (arm-empty)
   added: (holding b150) (clear b2)
   goals met: 7 of 14
62. (putdown b150)
   deleted: (holding b150)
   added: (clear b150) (arm-empty) (on-table b150)
   goals met: 7 of 14
63. (unstack b56 b112)
   deleted: (on b56 b112) (clear b56) (arm-empty)
   added: (holding b56) (clear b112)
   goals met: 7 of 14
64. (putdown b56)
   deleted: (holding b56)
   added: (clear b56) (arm-empty) (on-table b56)
   goals met: 7 of 14
65. (unstack b112 b1)
   deleted: (on b112 b1) (clear b112) (arm-empty)
   added: (holding b112) (clear b1)
   goals met: 7 of 14
66. (putdown b112)
   deleted: (holding b112)
   added: (clear b112) (arm-empty) (on-table b112)
   goals met: 7 of 14
67. (unstack b68 b228)
   deleted: (on b68 b228) (clear b68) (arm-empty)
   added: (holding b68) (clear b228)
   goals met: 7 of 14
68. (putdown b68)
   deleted: (holding b68)
   added: (clear b68) (arm-empty) (on-table b68)
   goals met: 7 of 14
69. (unstack b228 b3)
   deleted: (on b228 b3) (clear b228) (arm-empty)
   added: (holding b228) (clear b3)
   goals met: 8 of 14
70. (putdown b228)
   deleted: (holding b228)
   added: (clear b228) (arm-empty) (on-table b228)
   goals met: 8 of 14
71. (unstack b1 b245)
   deleted: (on b1 b245) (clear b1) (arm-empty)
   added: (holding b1) (clear b245)
   goals met: 8 of 14
72. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 9 of 14
73. (unstack b4 b155)
   deleted: (on b4 b155) (clear b4) (arm-empty)
   added: (holding b4) (clear b155)
   goals met: 9 of 14
74. (stack b4 b10)
   deleted: (clear b10) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b10)
   goals met: 10 of 14
75. (unstack b1 b2)
   deleted: (on b1 b2) (clear b1) (arm-empty)
   added: (holding b1) (clear b2)
   goals met: 9 of 14
76. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 9 of 14
77. (unstack b2 b339)
   deleted: (on b2 b339) (clear b2) (arm-empty)
   added: (holding b2) (clear b339)
   goals met: 9 of 14
78. (stack b2 b4)
   deleted: (clear b4) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b4)
   goals met: 10 of 14
79. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 10 of 14
80. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 11 of 14
81. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 11 of 14
82. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 12 of 14
83. (unstack b3 b229)
   deleted: (on b3 b229) (clear b3) (arm-empty)
   added: (holding b3) (clear b229)
   goals met: 11 of 14
84. (stack b3 b5)
   deleted: (clear b5) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b5)
   goals met: 13 of 14
85. (unstack b9 b81)
   deleted: (on b9 b81) (clear b9) (arm-empty)
   added: (holding b9) (clear b81)
   goals met: 12 of 14
86. (stack b9 b7)
   deleted: (clear b7) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b7)
   goals met: 14 of 14
